import {
  ImageBackground,
  StyleSheet,
  Text,
  View,
  ScrollView,
} from 'react-native';
import React from 'react';

export default function Definition({route}) {
  let definition: JSX.Element;

  const AutismeDefinition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };
  const SyndromeDownDefintition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };
  const NeuropedagogieDefinition = () => {
    return <Text>neuropedagigieDefinition</Text>;
  };
  const TroubleDeCompteDefinition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };
  const TroubleEcritureDefinition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };
  const TroubleLectureDefinition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };
  const TroubleAttentionDefinition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };
  const TroubleMouvementDefinition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };
  const TroubleParoleDefinition = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };

  const ResultatLobeposterieur = () => {
    return <Text>result Lobe Frontal</Text>;
  };

  const ResultatLobeparietal = () => {
    return <Text>result Lobe parietal</Text>;
  };

  const ResultatLobeTemporal = () => {
    return <Text>result Lobe Temporal</Text>;
  };
  const DefinitionNeuro = () => {
    return (
      <ScrollView>
        <View style={styles.text}>
          <Text style={styles.textStyling}>
            لقد اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك
            ، فقد اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة.
            في نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى. لقد
            اخترنا نصوص مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في نهاية
            النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك. وتجدر
            الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة حقيقية. من
            الآن فصاعدًا ، لن يكون للغة موليير أسرار أخرى بالنسبة لك ، فقد
            اخترنا نصوصًا من مدرسين فرنسيين ذوي خبرة يسهل قراءتها وممتعة. في
            نهاية النصوص ، يسمح لك التمرين في شكل MCQs بالتحقق من صحة معرفتك.
            وتجدر الإشارة إلى أن الإصدار المجاني للنصوص بصيغة PDF يعد إضافة
            حقيقية. من الآن فصاعدًا ، لن تحتوي لغة موليير على أسرار أخرى.
          </Text>
        </View>
      </ScrollView>
    );
  };

  if (route.params.nom == 'Autisme') {
    definition = <AutismeDefinition />;
  } else if (route.params.nom == 'Neuropedagogie') {
    definition = <NeuropedagogieDefinition />;
  } else if (route.params.nom == 'TroubleCompte') {
    definition = <TroubleDeCompteDefinition />;
  } else if (route.params.nom == 'TroubleAttention') {
    definition = <TroubleAttentionDefinition />;
  } else if (route.params.nom == 'TroubleEcriture') {
    definition = <TroubleEcritureDefinition />;
  } else if (route.params.nom == 'TroubleLecture') {
    definition = <TroubleLectureDefinition />;
  } else if (route.params.nom == 'TroubleMouvement') {
    definition = <TroubleMouvementDefinition />;
  } else if (route.params.nom == 'SyndromeDown') {
    definition = <SyndromeDownDefintition />;
  } else if (route.params.nom == 'ResultatLobeParietal') {
    definition = <ResultatLobeparietal />;
  } else if (route.params.nom == 'ResultatLobeposterieur') {
    definition = <ResultatLobeposterieur />;
  } else if (route.params.nom == 'ResultatLobeTemporal') {
    definition = <ResultatLobeTemporal />;
  } else if (route.params.nom == 'DefinitionNeuro') {
    definition = <DefinitionNeuro />;
  } else {
    definition = <TroubleParoleDefinition />;
  }
  return (
    <View style={styles.aaa}>
      <ImageBackground
        style={styles.backimage}
        source={require('../../assets/back00.jpeg')}>
        <View>{definition}</View>
      </ImageBackground>
    </View>
  );
}

const styles = StyleSheet.create({
  container: {
    flex: 1,
  },
  backimage: {
    flex: 1,
  },
  aaa: {
    flex: 1,
  },
  textStyling: {
    color: 'white',
    fontSize: 20,
  },
  text: {
    marginTop: 20,
    marginRight: 20,
  },
});
